app/controllers/areas_controller.rb

  def index
    @areas = Area.all
---
SELECT "areas".* FROM "areas"

  def create
    @area = Area.new(area_params)

    respond_to do |format|
      if @area.save
---
INSERT INTO "areas" ("created_at", "encargado", "nombre", "telefono", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Wed, 06 Nov 2013 22:35:32 UTC +00:00], ["encargado", "director"], ["nombre", "Sistemas"], ["telefono", 989108638], ["updated_at", Wed, 06 Nov 2013 22:35:32 UTC +00:00]]

    def set_area
      @area = Area.find(params[:id])
---
SELECT "areas".* FROM "areas" WHERE "areas"."id" = ? LIMIT 1  [["id", "1"]]