app/controllers/personals_controller.rb

  def index
    @personals = Personal.all
---
SELECT "personals".* FROM "personals"

  def create
    @personal = Personal.new(personal_params)

    respond_to do |format|
      if @personal.save
---
INSERT INTO "personals" ("apellidos", "cargo", "categoria", "created_at", "nombre", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def destroy
    @personal.destroy
---
DELETE FROM "personals" WHERE "personals"."id" = ?  [["id", 2]]

    def set_personal
      @personal = Personal.find(params[:id])
---
SELECT "personals".* FROM "personals" WHERE "personals"."id" = ? LIMIT 1  [["id", "2"]]